docs/reviews/2026-09-10-claude-follow-up-review-validation/mutation-provenance/withdrawal-shallow.patch
--- a/x/billing/keeper/provider_withdrawal.go
+++ b/x/billing/keeper/provider_withdrawal.go
@@ -79 +78,0 @@
-	settledLease.Reservation = cloneLeaseReservation(lease.Reservation)
