docs/reviews/2026-09-11-claude-review-validation/terminal-mutations/skipped-zero.patch
--- a/x/billing/keeper/msg_server.go
+++ b/x/billing/keeper/msg_server.go
@@ -883 +883 @@
-		if result.TransferAmounts.IsZero() && !finalizeClosedInterval {
+		if result.TransferAmounts.IsZero() {
